app/controllers/auth/v1/auth_controller.rb

INSERT INTO "accounts" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
      def sign_up
        account = Account.create!(resource_params)