app/controllers/v1/account_profiles_controller.rb

INSERT INTO "profiles" ("account_id", "type", "first_name", "last_name", "first_name_kana", "last_name_kana", "gender", "phone", "postal_code", "address", "date_of_birth", "biography") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create
      @account_profile.save!