app/models/concerns/j_w_t/authenticatable.rb

      def jwt
        iat = Time.now.to_i
        exp = iat + 7 * 3600
        jti = Jti.create!
---
INSERT INTO "jtis" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-05-08 04:31:22.077700"], ["updated_at", "2021-05-08 04:31:22.077700"]]